# Datasets Portal da Transparência da Mobilidade Urbana de Natal/RN

**Bilhetagem Eletrônica**

**Custos Operacionais**

**Itinerários**

**Horários Programados**

**Linhas**

**Paradas**

**Rotas**

-   Cidade do Natal
-   Conceição
-   Guanabara
-   Reunidas
-   Santa Maria
-   Via Sul

In [2]:
import pandas as pd

## Dataset Bilhetagem Eletrônica

http://dados.natal.br/dataset/bilhetagem-eletronica

Dados BE 2018 - Analitico
http://dados.natal.br/dataset/4fad551d-4d3b-4597-b8d3-7e887e22332e/resource/ec5b95a3-7b93-4346-98f6-1bd013faa651/download/dados-be-2018-analitico.csv

Dados BE 2019 - Analitico
http://dados.natal.br/dataset/4fad551d-4d3b-4597-b8d3-7e887e22332e/resource/0d4a0f0f-b8a5-46a0-acfe-bb9138c8eb9e/download/dados-be-2019-analitico.csv

## Download do arquivo csv
Vamos baixar o arquivo de 2018 com o comando wget
comando abaixo esta comentando em função do Windows 10 não possuir o comando.

In [5]:
#wget -c http://dados.natal.br/dataset/4fad551d-4d3b-4597-b8d3-7e887e22332e/resource/ec5b95a3-7b93-4346-98f6-1bd013faa651/download/dados-be-2018-analitico.csv

Verificar o arquivo baixado com o comando
*ls -lah dados-be**

In [ ]:
#ls -lah dados-be*

## Carregar o arquivo CSV

In [3]:
df = pd.read_csv("data\dados-be-2018-analitico.csv", encoding='iso-8859-1', sep=';', thousands=r'.')

Checar se o arquivo foi carregado exibindo os primeiros registros

In [5]:
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
0,1,CONCEIÇÃO,21,13493,9506,35944,8671,0,17138,7397,6542,43727,3965,3684
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1737
2,1,CONCEIÇÃO,30,8519,5614,20580,5346,0,7265,3191,4415,21507,1537,2500
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2922,5491,22212,140,2478
4,1,CONCEIÇÃO,41,6556,4038,20388,7924,0,5704,2791,3883,13870,0,2296

Exibir os últimos registros

In [6]:
df.tail()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
1136,12,SANTA MARIA - URB,561,86,74,2246,538,0,121,5,254,1142,39,323
1137,12,VIA SUL - URB,50,32292,10684,66908,19143,209,15496,8756,13530,64305,1622,4881
1138,12,VIA SUL - URB,51,18806,5839,23269,8069,0,9071,6594,6272,29691,317,3179
1139,12,VIA SUL - URB,52,15491,5551,23300,6775,1,10346,7737,5630,33071,394,3062
1140,12,VIA SUL - URB,65,9250,2991,13407,3685,0,4153,2421,3475,13610,0,1761

Exibir 10 registros aleatórios

In [7]:
df.sample(10)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
137,2,GUANABARA - URB,72,11366,6718,28085,7090,122,6249,3002,5430,30652,670,1954
627,7,GUANABARA - URB,7502,1475,413,1663,367,0,611,277,483,1877,0,158
183,2,SANTA MARIA - URB,66,7483,5794,13471,1938,0,3053,1758,2968,17301,1121,1933
1128,12,SANTA MARIA - URB,48,12260,4343,14587,5088,0,7168,5113,3111,22690,747,2165
262,3,REUNIDAS,6443,9957,4735,18841,4440,9,6298,2603,4431,17776,314,1206
69,1,REUNIDAS,35,14300,8069,35898,11112,813,13376,6317,9356,30393,2981,2757
608,7,GUANABARA - URB,76,3388,1305,6959,1566,61,3567,922,1425,7836,0,576
866,10,CONCEIÇÃO,587,1977,3,610,202,0,1231,230,155,1858,285,1492
830,9,REUNIDAS,1778,4669,954,7679,1490,40,2887,1768,1505,8280,730,759
189,2,VIA SUL - URB,50,27193,17532,59793,17904,136,14454,6269,11507,51027,1620,4241

Visualizar o descritivo da estrtura de dados com o número de linhas e colunas

In [8]:
df.shape

(1141, 14)

Visualizar informações básicas do dataset como colunas, tamanho, tipo de valores, etc..

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1141 entries, 0 to 1140
Data columns (total 14 columns):
Mês                        1141 non-null int64
Empresa                    1141 non-null object
Linha                      1141 non-null int64
Estudante_Cartao           1141 non-null int64
Estudante_BT               1141 non-null int64
Vale_Transporte            1141 non-null int64
Integracao_Plena           1141 non-null int64
Integracao_Complementar    1141 non-null int64
Gratuito_Cartao            1141 non-null int64
Gratuito_BT                1141 non-null int64
Inteira_Cartao             1141 non-null int64
Inteira_Especie            1141 non-null int64
Tarifa_Social              1141 non-null int64
Qtd_Viagens                1141 non-null int64
dtypes: int64(13), object(1)
memory usage: 124.9+ KB

Exibir informações estatísticas das colunas numéricas

In [10]:
df.describe()

,Mês,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
count,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000,1141.000000
mean,6.501315,1111.489045,13357.290096,5142.852761,21148.921998,6045.431201,73.226994,7238.357581,3461.227870,4510.539001,21086.677476,1045.451358,1907.993865
std,3.464006,2241.727880,12271.943573,5299.710310,19264.622770,6105.457782,163.958350,6295.643277,3010.474741,3765.546539,17995.550555,1808.953070,1284.056937
min,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,3.000000,39.000000,4138.000000,1334.000000,6673.000000,1441.000000,0.000000,2908.000000,987.000000,1438.000000,7176.000000,0.000000,760.000000
50%,7.000000,75.000000,9631.000000,3623.000000,15713.000000,4093.000000,0.000000,5884.000000,2929.000000,3588.000000,17289.000000,276.000000,1772.000000
75%,10.000000,599.000000,19605.000000,7279.000000,31430.000000,8901.000000,65.000000,10178.000000,5036.000000,6876.000000,31185.000000,1345.000000,2817.000000
max,12.000000,9018.000000,64442.000000,38952.000000,114307.000000,35933.000000,1353.000000,37702.000000,17586.000000,18331.000000,97977.000000,17298.000000,5407.000000

Exibir tipos de dados por coluna

In [11]:
df.dtypes

Mês                         int64
Empresa                    object
Linha                       int64
Estudante_Cartao            int64
Estudante_BT                int64
Vale_Transporte             int64
Integracao_Plena            int64
Integracao_Complementar     int64
Gratuito_Cartao             int64
Gratuito_BT                 int64
Inteira_Cartao              int64
Inteira_Especie             int64
Tarifa_Social               int64
Qtd_Viagens                 int64
dtype: object

Exibir os dados da quinta linha

In [14]:
df.loc[4]

Mês                                1
Empresa                    CONCEIÇÃO
Linha                             59
Estudante_Cartao                8184
Estudante_BT                    6086
Vale_Transporte                22623
Integracao_Plena                7332
Integracao_Complementar            0
Gratuito_Cartao                13514
Gratuito_BT                     4373
Inteira_Cartao                  4622
Inteira_Especie                29075
Tarifa_Social                   4573
Qtd_Viagens                     2650
Name: 5, dtype: object

Exibir as linhas a partir da 4 ate a 8

In [15]:
df.loc[3:7]

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2922,5491,22212,140,2478
4,1,CONCEIÇÃO,41,6556,4038,20388,7924,0,5704,2791,3883,13870,0,2296
5,1,CONCEIÇÃO,59,8184,6086,22623,7332,0,13514,4373,4622,29075,4573,2650
6,1,CONCEIÇÃO,63,21918,14054,44118,14630,0,15034,5771,7765,39855,3182,3768
7,1,CONCEIÇÃO,71,7188,5395,19626,4209,0,10865,4075,3608,23923,3773,2389

Exibir apenas as linhas 2, 5 e 10

In [16]:
df.loc[[1,4,9]]

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1737
4,1,CONCEIÇÃO,41,6556,4038,20388,7924,0,5704,2791,3883,13870,0,2296
9,1,CONCEIÇÃO,83,4386,3932,14967,1194,0,3207,1125,2573,17649,2491,1284

Selecione as linhas da empresa específicas

In [17]:
df[df['Empresa'] == "CONCEIÇÃO"].head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
0,1,CONCEIÇÃO,21,13493,9506,35944,8671,0,17138,7397,6542,43727,3965,3684
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1737
2,1,CONCEIÇÃO,30,8519,5614,20580,5346,0,7265,3191,4415,21507,1537,2500
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2922,5491,22212,140,2478
4,1,CONCEIÇÃO,41,6556,4038,20388,7924,0,5704,2791,3883,13870,0,2296

Exibir coluna individual

In [18]:
df['Empresa'].head()

0    CONCEIÇÃO
1    CONCEIÇÃO
2    CONCEIÇÃO
3    CONCEIÇÃO
4    CONCEIÇÃO
Name: Empresa, dtype: object

Exibir a quantidade de empresas únicas

In [19]:
empresas = df['Empresa'].unique()
len(empresas)

6

Selecionar multiplas colunas pelo nome

In [4]:
df[['Empresa', 'Linha']].head()

     Empresa  Linha
0  CONCEIÇÃO     21
1  CONCEIÇÃO     22
2  CONCEIÇÃO     30
3  CONCEIÇÃO     31
4  CONCEIÇÃO     41

Apagar Colunas

In [5]:
df.drop(['Estudante_Cartao','Estudante_BT'], axis=1).head()

,Mês,Empresa,Linha,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens
0,1,CONCEIÇÃO,21,35944,8671,0,17138,7397,6542,43727,3965,3684
1,1,CONCEIÇÃO,22,13088,3230,0,8109,3157,2529,15363,0,1737
2,1,CONCEIÇÃO,30,20580,5346,0,7265,3191,4415,21507,1537,2500
3,1,CONCEIÇÃO,31,23460,7587,0,7065,2922,5491,22212,140,2478
4,1,CONCEIÇÃO,41,20388,7924,0,5704,2791,3883,13870,0,2296

In [6]:
df.columns

Index(['Mês', 'Empresa', 'Linha', 'Estudante_Cartao', 'Estudante_BT',
       'Vale_Transporte', 'Integracao_Plena', 'Integracao_Complementar',
       'Gratuito_Cartao', 'Gratuito_BT', 'Inteira_Cartao', 'Inteira_Especie',
       'Tarifa_Social', 'Qtd_Viagens'],
      dtype='object')

Exibir algumas colunas

In [7]:
df.drop(df.columns.difference(['Mês','Empresa','Qtd_Viagens']), axis=1).head()

   Mês    Empresa  Qtd_Viagens
0    1  CONCEIÇÃO         3684
1    1  CONCEIÇÃO         1737
2    1  CONCEIÇÃO         2500
3    1  CONCEIÇÃO         2478
4    1  CONCEIÇÃO         2296

Adicionar colunas calculadas

In [9]:
df['Integracao_Total'] = df['Integracao_Plena'] + df['Integracao_Complementar']
df.sample(5)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
404,5,DUNAS - URB,411,5343,1728,7634,3283,0,3133,998,2053,7490,573,732,3283
507,6,GUANABARA - URB,25,7552,3079,8260,2273,0,4986,2991,1560,9165,0,1427,2273
427,5,GUANABARA - URB,592,2019,447,2169,477,82,1155,244,397,1657,160,821,559
660,7,VIA SUL - URB,52,14554,8763,23378,7767,0,11128,6892,6100,27427,0,3088,7767
466,5,SANTA MARIA - URB,83,8627,4040,16641,1475,0,4137,1452,3242,17725,1851,1386,1475

Converte coluna Linha em string

In [11]:
df["Linha"] = df["Linha"].astype(str)

Método para converter o número do mês em extenso

In [13]:
from calendar import month_name
month_names = df.Mês.apply(lambda x: month_name[x])

In [14]:
month_names.sample(5)

314        April
837    September
538         June
168     February
779    September
Name: Mês, dtype: object

In [16]:
df['Month'] = month_names
df.head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
0,1,CONCEIÇÃO,21,13493,9506,35944,8671,0,17138,7397,6542,43727,3965,3684,8671,January
1,1,CONCEIÇÃO,22,4644,3371,13088,3230,0,8109,3157,2529,15363,0,1737,3230,January
2,1,CONCEIÇÃO,30,8519,5614,20580,5346,0,7265,3191,4415,21507,1537,2500,5346,January
3,1,CONCEIÇÃO,31,9631,6020,23460,7587,0,7065,2922,5491,22212,140,2478,7587,January
4,1,CONCEIÇÃO,41,6556,4038,20388,7924,0,5704,2791,3883,13870,0,2296,7924,January

Classificar o dataset por uma coluna especifica

In [18]:
df.sort_values("Qtd_Viagens", ascending=False).head()

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
756,8,VIA SUL - URB,50,50046,18556,75385,24216,270,19818,8773,16290,63519,0,5407,24486,August
921,10,REUNIDAS,73,64442,17125,112219,34462,552,17811,10888,16827,79980,17298,5402,35014,October
258,3,REUNIDAS,73,56313,38952,114307,35933,572,17999,9226,16100,85992,3742,5259,36505,March
1113,12,REUNIDAS,73,42971,17323,111346,31905,533,16845,10359,15992,97977,3767,5244,32438,December
730,8,REUNIDAS,73,59512,28088,112950,35284,561,17999,10048,17879,86623,0,5224,35845,August

Classificar mais de uma coluna

In [19]:
df.sort_values(by=['Estudante_Cartao', 'Estudante_BT'], ascending=False).head(10)

,Mês,Empresa,Linha,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total,Month
921,10,REUNIDAS,73,64442,17125,112219,34462,552,17811,10888,16827,79980,17298,5402,35014,October
827,9,REUNIDAS,73,64051,14496,106976,33082,544,16997,10421,16265,88285,4926,5107,33626,September
681,8,DUNAS - URB,33,63380,22643,76702,20822,205,20232,7795,18331,71492,0,4575,21027,August
874,10,DUNAS - URB,33,62959,11712,73935,20262,182,20276,8003,16988,64794,11973,4481,20444,October
779,9,DUNAS - URB,33,60017,9664,67806,18870,161,18092,7474,16496,67102,2964,4305,19031,September
730,8,REUNIDAS,73,59512,28088,112950,35284,561,17999,10048,17879,86623,0,5224,35845,August
668,8,CONCEIÇÃO,63,59056,17759,51840,26449,0,19201,7964,10033,45732,0,4303,26449,August
1018,11,REUNIDAS,73,57807,17702,107876,32135,489,17068,10319,15859,81580,14338,5187,32624,November
968,11,DUNAS - URB,33,56990,12247,71070,19556,151,19271,8292,16684,65799,9336,4457,19707,November
399,5,DUNAS - URB,33,56739,22310,73401,20825,0,19751,6701,16488,70927,5240,4495,20825,May

Agrupando informações em coluna

In [20]:
df.groupby(['Month','Mês'], as_index=False).sum()

,Month,Mês,Estudante_Cartao,Estudante_BT,Vale_Transporte,Integracao_Plena,Integracao_Complementar,Gratuito_Cartao,Gratuito_BT,Inteira_Cartao,Inteira_Especie,Tarifa_Social,Qtd_Viagens,Integracao_Total
0,April,4,1331095,678262,2016760,604373,7247,696498,312804,421292,1934271,80615,182136,611620
1,August,8,1584763,560499,2164823,640724,8088,755925,364295,488153,2135562,0,195284,648812
2,December,12,1093361,340437,1989931,508305,6467,656551,351139,421933,2258983,67389,182116,514772
3,February,2,922115,560997,1793071,504393,5204,606608,275400,370324,1857316,67013,161318,509597
4,January,1,729392,521541,2010298,549134,5591,671461,305725,404810,1998704,168228,184030,554725
5,July,7,1084662,484700,2024453,557249,7284,684655,318444,430359,1961328,0,182527,564533
6,June,6,1218904,542724,1980585,570681,7436,666944,311043,418158,1884429,0,174948,578117
7,March,3,1368779,743969,2103611,622058,6953,730598,323111,445180,2106287,59430,187775,629011
8,May,5,1391679,512755,2061006,608455,7760,706790,319696,436692,2016118,136120,178362,616215
9,November,11,1397818,328853,1959551,553386,6801,676495,351360,418634,1917710,235526,179024,560187
10,October,10,1571000,319749,2066691,601418,7657,720123,366005,449238,1946104,295491,189004,609075
11,September,9,1547100,273509,1960140,577661,7064,686318,350239,441752,2043087,83048,180497,584725